---
kind: method
id: M:Autodesk.Revit.DB.View.AllowsAnalysisDisplay
zh: 视图
source: html/4b6a7c05-6ab2-5920-2a8e-41525a706125.htm
---
# Autodesk.Revit.DB.View.AllowsAnalysisDisplay Method

**中文**: 视图

Identifies if this view allows display of Analysis results.

## Syntax (C#)
```csharp
public bool AllowsAnalysisDisplay()
```

## Returns
True if the view allows display of Analysis results, false otherwise.